Repository: nate-xyz/paleta
Catalog: po/*.po
Languages: es, tr, uk

source: Color Palettes
es: Paletas de colores
tr: Renk Paletleri
uk: Палітри кольорів

source: Extract the dominant colors from any image
es: Extrae los colores dominantes de cualquier imagen
tr: Herhangi bir görüntüden baskın renkleri çıkar
uk: Отримайте домінуючі кольори із будь-якого зображення

source: color;palette;
es: color;paleta;
tr: renk;palet;
uk: колір;палітра;

source: Generate color palettes with ease
es: Genere paletas de colores fácilmente
tr: Kolayca renk paletleri oluştur
uk: Генеруйте кольорову палітру із легкістю

source: Find the dominant color palette from any image and manage palettes with Paleta. An intuitive tool for designers, artists, or anyone looking to streamline their color work.
es: Encuentre la paleta de colores dominante de cualquier imagen y gestiónelas con Paleta. Una herramienta intuitiva para diseñadores, artistas o cualquier persona que busque optimizar su trabajo de color.
tr: Paleta ile herhangi bir görüntüden baskın renk paletini bulun ve paletleri yönetin. Tasarımcılar, sanatçılar veya renk çalışmalarını düzene sokmak isteyen herkes için sezgisel bir araç.
uk: Знаходьте домінуючу кольорову палітру із будь-якого зображення і керуйте палітрами за допомогою Paleta. Інтуїтивний інструмент для дизайнерів, художників, або будь-кого хто хоче полегшити роботу з кольорами.

source: Features:
es: Funciones:
tr: Özellikler:
uk: Функції:

source: Drag and drop images to load
es: Arrastrar y soltar las imágenes para cargarlas
tr: Yüklemek için görüntüleri sürükleyip bırakma
uk: Перетягування зображення для завантаження

source: Color extraction with color-thief
es: Extraer los colores con color-thief
tr: Renk hırsızı ile renk çıkarma
uk: Отримування кольорів за допомогою color-thief

source: Save extracted palettes for later use
es: Guardar las paletas extraídas para utilizarlas más tarde
tr: Çıkarılan paletleri daha sonra kullanmak üzere kaydetme
uk: Зберігання палітри для наступного використання

source: Modify saved palette name and colors
es: Modificar el nombre y los colores de la paleta guardada
tr: Kaydedilen palet adını ve renkleri değiştirme
uk: Модифікування назви та кольорів збереженої палітри

source: Add new palettes from scratch
es: Añadir nuevas paletas desde cero
tr: Sıfırdan yeni paletler ekleme
uk: Додавання нової палітру з нуля

source: ❗ Note: Paleta is under active development! If you would like to suggest any features or if you find any bugs, your feedback is very welcome!
es: ❗ Nota: ¡Paleta está en desarrollo activo! Si desea sugerir alguna característica o si encuentra algún error, ¡sus comentarios son muy bienvenidos!
tr: ❗ Not: Paleta aktif geliştirme aşamasındadır! Herhangi bir özellik önermek isterseniz veya herhangi bir hata bulursanız, geri bildiriminiz memnuniyetle karşılanır!
uk: ❗Увага: Paleta знаходиться у стані активної розробки! Якщо ви бажаєте запропонувати ідею або якщо ви наштовхнулися на збій, ваш зворотній зв'язок буде дуже вітатися!

source: Added German, Hindi, Occitan, Polish, and Russian translations!
es: ¡Añadidas traducciones al alemán, hindi, occitano, polaco y ruso!
tr: Almanca, Hintçe, Oksitanca, Lehçe ve Rusça çeviriler eklendi!
uk: Додано німецький, хінді, окситанський, польський та російський переклади!

source: Fixed translations for Rust version
es: Traducciones corregidas para la versión Rust
tr: Rust sürümü için çeviriler düzeltildi
uk: Виправлено переклади для Rust версії додатку

source: Rewritten in Rust, now uses colorthief-rs!
es: Reescrito en Rust, ¡ahora utiliza colorthief-rs!
tr: Rust ile yeniden yazıldı, artık colorthief-rs kullanıyor!
uk: Додаток переписаний у Rust, тепер використовує colorthief-rs!

source: Added Translation Support
es: Añadido soporte de traducción
tr: Çeviri desteği eklendi
uk: Додана підтримка локалізацій

source: Added French and Dutch translations!
es: ¡Añadidas traducciones al francés y al neerlandés!
tr: Fransızca ve Felemenkçe çeviriler eklendi!
uk: Додано французький та голландський переклади!

source: Automatic palette extraction on image load
es: Extracción automática de paletas al cargar la imagen
tr: Görüntü yüklemede kendiliğinden palet çıkarma
uk: Автоматичне отримування палітри при завантаженні зображення

source: Cleaner extraction panel UI
es: Interfaz del panel de extracción más limpia
tr: Daha temiz çıkarma paneli kullanıcı arayüzü
uk: Покращення інтерфейсу отримування кольорів

source: Clearer options for palette quality / accuracy
es: Opciones más claras para la calidad/precisión de las paletas
tr: Palet kalitesi / doğruluğu için daha net seçenekler
uk: Покращення для опцій якості палітри

source: Better AppData summary
es: Mejor resumen de datos de la aplicación
tr: Daha iyi AppData özeti
uk: Покращено підсумок додатку

source: Toast improvements
es: Notificaciones emergentes mejoradas
tr: Bildirim iyileştirmeleri
uk: Покращення вспливаючих вікон

source: Drop Page open button
es: Botón abrir en la página de carga de imágenes
tr: Bırak Sayfası aç düğmesi
uk: Кнопка відкриття файла на сторінці перетягування файлів

source: translator-credits
es: créditos de traducción
tr: Sabri Ünal <libreajans@gmail.com>
uk: volkov <volkovissocool@gmail.com>

source: Powered by color-thief
tr: color-thief ile güçlendirilmiştir
uk: Працює за допомогою color-thief

source: _Open Image
es: _Abrir imagen
tr: Görüntü _Aç
uk: _Відкрити зображення

source: _Cancel
es: _Cancelar
tr: _İptal
uk: _Скасувати

source: Select an Image File
es: Seleccione un archivo de imagen
tr: Görüntü Dosyası Seç
uk: Оберіть файл зображення

source: Unable to load file.
es: No se ha podido cargar el archivo.
tr: Dosya yüklenemiyor.
uk: Неможливо завантажити файл.

source: Copied color {color_hex} to clipboard!
es: ¡Color copiado {color_hex} al portapapeles!
tr: {color_hex} rengi panoya kopyalandı!
uk: Скопійовано колір {color_hex} до буферу обміну!

source: <span foreground={ERROR_RED}>Error!</span> {error_msg}
tr: <span foreground={ERROR_RED}>Hata!</span> {error_msg}
uk: <span foreground={ERROR_RED}>Помилка!</span> {error_msg}

source: <span foreground={SUCCESS_GREEN}>Opened image:</span> {image_name}
es: <span foreground={SUCCESS_GREEN}>Imagen abierta:</span> {image_name}
tr: <span foreground={SUCCESS_GREEN}>Açılan görüntü:</span> {image_name}
uk: <span foreground={SUCCESS_GREEN}>Відкрито зображення:</span> {image_name}

source: Could not open image: {image_name}
es: No se pudo abrir la imagen: {image_name}
tr: Görüntü açılamadı: {image_name}
uk: Не вдалося відкрити: {image_name}

source: Added color {color_hex} to palette «{palette_name}».
es: Se agregó el color {color_hex} a la paleta «{palette_name}».
tr: {color_hex} rengi “{palette_name}” paletine eklendi.
uk: Додано колір {color_hex} до палітри "{palette_name}".

source: Removed color {color_hex} from palette «{palette_name}».
es: Se eliminó el color {color_hex} de la paleta «{palette_name}».
tr: {color_hex} rengi “{palette_name}” paletinden kaldırıldı.
uk: Видалено колір {color_hex} із палітри "{palette_name}".

# shortcut window
source: General
tr: Genel
uk: Загальні

# shortcut window
source: Show Shortcuts
es: Mostrar accesos directos
tr: Kısayolları Göster
uk: Показати клавіатурні скорочення

# shortcut window
source: Quit
es: Salir
tr: Çık
uk: Вийти

# shortcut window
source: Image
es: Imagen
tr: Görüntü
uk: Зображення

# shortcut window
source: Open Image
es: Abrir imagen
tr: Görüntü Aç
uk: Відкрити зображення

# shortcut window
source: Extract Palette
es: Extraer Paleta
tr: Palet Çıkar
uk: Отримати палітру

# shortcut window
source: Save Extracted Palette
es: Guardar paleta extraída
tr: Çıkarılan Paleti Kaydet
uk: Зберегти отриману палітру

# shortcut window
source: Go To Image Drop Page
es: Ir a la página de carga de imágenes
tr: Görüntü Bırakma Sayfasına Git
uk: Перейти до сторінки перетягування файлів

# shortcut window
source: Palettes
es: Paletas
tr: Paletler
uk: Палітри

# shortcut window
source: Toggle Edit Mode
es: Cambiar al modo de edición
tr: Düzenleme Kipini Aç/Kapat
uk: Перемикнути режим редагування

# shortcut window
source: Add Palette
es: Agregar paleta
tr: Palet Ekle
uk: Додати палітру

# shortcut window
source: Go To Palette Page
es: Ir a la página de paletas
tr: Palet sayfasına Git
uk: Перейти на сторінку палітри

source: Open Image
es: Abrir imagen
tr: Görüntü Aç
uk: Відкрити зображення

source: Edit Palettes
es: Editar paletas
tr: Paletleri Düzenle
uk: Редагувати палітри

source: Drop
es: Carga de imágenes
tr: Bırak
uk: Перетягнути

source: Palettes
es: Paletas
tr: Paletler
uk: Палітри

source: _Keyboard Shortcuts
es: _Atajos de teclado
tr: _Klavye Kısayolları
uk: _Клавіатурні скорочення

source: _About Paleta
es: _Acerca de Paleta
tr: Paleta _Hakkında
uk: _Про Paleta

source: Add Color to {palette_name}
es: Añadir color a {palette_name}
tr: {palette_name} paletine renk ekle
uk: Додати колір до {palette_name}

source: Pick a new color to add to {palette_name}.
es: Elija un nuevo color para agregar a {palette_name}.
tr: {palette_name} paletine eklemek için yeni renk seç.
uk: Обрати новий колір для {palette_name}.

source: Currently selected color: {color_hex}
es: Color actualmente seleccionado: {color_hex}
tr: Geçerli seçili renk: {color_hex}
uk: Поточний обраний колір: {color_hex}

source: Choose new color to add to {palette_name}
es: Elija un nuevo color para agregar a {palette_name}
tr: {palette_name} paletine eklemek için yeni renk seç.
uk: Оберіть новий колір для {palette_name}

source: Unable to add color {color_hex}.
es: No se puede agregar el color {color_hex}.
tr: {color_hex} rengi eklenemiyor.
uk: Неможливо додати колір {color_hex}.

source: Unable to add color.
es: No se puede agregar el color.
tr: Renk eklenemiyor.
uk: Неможливо додати колір.

source: Palette #{palette_index}
es: Paleta #{palette_index}
tr: Palet #{palette_index}
uk: Палітра #{palette_index}

source: Pick a new color to add to new palette.
es: Elija un nuevo color para agregar a la nueva paleta.
tr: Yeni palete eklemek için yeni renk seç.
uk: Оберіть новий колір для додавання у нову палітру.

source: Choose color to add to new palette
es: Elija el color para agregar a la nueva paleta
tr: Yeni palete eklemek için renk seç
uk: Оберіть колір для додавання у нову політру

source: Created!
es: ¡Creada!
tr: Oluşturuldu!
uk: Створено!

source: New palette: «{palette_name}»
es: Nueva paleta: «{palette_name}»
tr: Yeni palet: “{palette_name}”
uk: Нова палітра: "{palette_name}"

source: Unable to add new palette «{palette_name}»
es: No se puede agregar la nueva paleta «{palette_name}»
tr: Yeni “{palette_name}” paleti eklenemiyor
uk: Неможливо додати нову палітру "{palette_name}"

source: Unable to add palette, must select a color.
es: No se puede agregar la paleta, debe seleccionar un color.
tr: Yeni palet eklenemiyor, renk seçmelisiniz.
uk: Неможливо додати палітру, треба обрати колір.

source: Remove color {color_hex} from {palette_name}?
es: ¿Eliminar el color {color_hex} de {palette_name}?
tr: {palette_name} paletinden {color_hex} rengi kaldırılsın mı?
uk: Видалити колір {color_hex} із {palette_name}?

source: Unable to remove color {color_hex}.
es: No se puede eliminar el color {color_hex}.
tr: {color_hex} rengi kaldırılamıyor.
uk: Неможливо видалити колір {color_hex}.

source: Unable to remove color.
es: No se puede quitar el color.
tr: Renk kaldırılamıyor.
uk: Неможливо видалити колір.

source: Delete {palette_name}?
es: Eliminar {palette_name}?
tr: {palette_name} paleti silinsin mi?
uk: Видалити {palette_name}?

source: Removed
es: Eliminado
tr: Kaldırıldı
uk: Видалено

source: palette: «{palette_name}».
es: paleta: «{palette_name}».
tr: palet: “{palette_name}”.
uk: палітра "{palette_name}".

source: Unable to delete palette «{palette_name}».
es: No se puede eliminar la paleta «{palette_name}».
tr: “{palette_name}” paleti silinemiyor.
uk: Не вдалося видалити палітру "{palette_name}".

source: Unable to delete palette.
es: No se puede eliminar la paleta.
tr: Palet silinemiyor.
uk: Не вдалося видалити палітру.

source: Duplicate {palette_name}?
es: Duplicar {palette_name}?
tr: {palette_name} paleti çoğaltılsın mı?
uk: Дублювати палітру {palette_name}?

source: {palette_name} duplicate
es: {palette_name} duplicada
tr: {palette_name} çoğaltılmış
uk: Дублікат {palette_name}

source: Duplicated!
es: ¡Duplicada!
tr: Çoğaltıldı!
uk: Продубльовано!

source: Copied «{original_palette}» to «{duplicate_palette}».
es: Se copió «{original_palette}» a «{duplicate_palette}».
tr: “{original_palette}” paleti “{duplicate_palette}” paletine kopyalandı.
uk: Скопійовано "{original_palette}" у "{duplicate_palette}".

source: Unable to duplicate palette «{palette_name}».
es: No se puede duplicar la paleta «{palette_name}».
tr: “{palette_name}” paleti çoğaltılamıyor.
uk: Не вдалося дублювати палітру "{palette_name}".

source: Unable to duplicate palette.
es: No se puede duplicar la paleta.
tr: Palet çıkarılamıyor.
uk: Не вдалося дублювати палітру.

source: Rename {palette_name}?
es: ¿Cambiar el nombre de {palette_name}?
tr: {palette_name} paleti yeniden adlandırılsın mı?
uk: Змінити назву {palette_name}?

source: Renamed!
es: ¡Renombrada!
tr: Yeniden adlandırıldı!
uk: Назва змінена!

source: Changed name from «{old_palette_name}» to «{new_palette_name}».
es: Se cambió el nombre de «{old_palette_name}» a «{new_palette_name}».
tr: “{old_palette_name}” paleti, “{new_palette_name}” olarak yeniden adlandırıldı.
uk: Назва змінена з "{old_palette_name}" на "{new_palette_name}".

source: Unable to rename palette «{palette_name}».
es: No se puede cambiar el nombre de la paleta «{palette_name}».
tr: “{palette_name}” paleti yeniden adlandırılamıyor.
uk: Не вдалося змінити назву палітри "{palette_name}".

source: Unable to rename palette.
es: No se puede cambiar el nombre de la paleta.
tr: Palet yeniden adlandırılamıyor.
uk: Не вдалося змінити назву палітри.

source: Saved!
es: ¡Guardado!
tr: Kaydedildi!
uk: Збережено!

source: Unable to add palette, no colors extracted.
es: No se puede agregar paleta, no se extraen colores.
tr: Palet eklenemiyor, renk çıkarılmadı.
uk: Не вдалося додати палітру, не отримано жодного кольору.

source: Add Color to Palette
es: Agregar color a la paleta
tr: Palete Renk Ekle
uk: Додати колір до палітри

source: _Add Color
es: _Agregar color
tr: Renk _Ekle
uk: _Додати колір

source: Select from previously added colors or pick a new one.
es: Seleccione entre los colores agregados anteriormente o elija uno nuevo.
tr: Daha önce eklenen renkler arasından seçim yapın ya da yeni bir tane seçin.
uk: Оберіть із попередньо обраних кольорів або оберіть нову.

source: _Choose with Picker
es: _Elegir con el selector
tr: _Seçici ile Seç
uk: _Обрати за допомогою піпетки

source: Add New Palette
es: Agregar nueva paleta
tr: Yeni Palet Ekle
uk: Додати нову палітру

source: _Add Palette
es: _Agregar paleta
tr: Palet _Ekle
uk: _Додати палітру

source: New Palette _Name
es: Nuevo _Nombre de la paleta
tr: Yeni Palet _Adı
uk: Нова _назва палітри

source: Select from previously added colors or pick one to add to new palette.
es: Seleccione entre los colores agregados previamente o elija uno para agregar a la nueva paleta.
tr: Önceden eklenen renklerden birini seçin ya da yeni palete eklemek için birini seçin.
uk: Оберіть із раніше обраних кольорів або оберіть новий із палітри.

source: Remove Color from Palette?
es: ¿Quitar color de la paleta?
tr: Renk Paletten Kaldırılsın Mı?
uk: Видалити колір із палітри?

source: _Remove
es: _Eliminar
tr: _Kaldır
uk: _Видалити

source: Delete Palette?
es: ¿Eliminar paleta?
tr: Paleti Silinsin Mi?
uk: Видалити палітру?

source: _Delete
es: _Eliminar
tr: _Sil
uk: _Видалити

source: This action will permanently remove this palette from Paleta.
es: Esta acción eliminará permanentemente esta paleta de Paleta.
tr: Bu işlem, bu paleti Paletaʼdan kalıcı olarak kaldıracak.
uk: Ця дія безповоротно видалить палітру із Paleta.

source: Duplicate Palette?
es: ¿Duplicar paleta?
tr: Palet Çoğaltılsın Mı?
uk: Дублювати палітру?

source: _Duplicate
es: _Duplicar
tr: _Çoğalt
uk: _Дублювати

source: Duplicated Palette _Name
es: _Nombre de paleta duplicado
tr: Çoğaltılmış Palet _Adı
uk: Нова _назва продубльованої палітри

source: Rename Palette?
es: ¿Renombrar paleta?
tr: Palet Yeniden Adlandırılsın Mı?
uk: Змінити назву палітри?

source: _Rename
es: _Renombrar
tr: _Yeniden Adlandır
uk: _Змінити назву

source: Save Palette?
es: ¿Guardar paleta?
tr: Palet Kaydedilsin Mi?
uk: Зберегти палітру?

source: _Save
es: _Guardar
tr: _Kaydet
uk: _Зберегти

source: Palette _Name
es: _Nombre de la paleta
tr: Palet _Adı
uk: _Назва палітри

source: Unable to start palette extraction, no image loaded.
es: No se puede iniciar la extracción de la paleta, no se cargó ninguna imagen.
tr: Palet çıkartma başlatılamıyor, görüntü yüklenmemiş.
uk: Неможливо почати отримання палітри, зображення не завантажено.

source: Unable to extract colors from image.
es: No se pueden extraer colores de la imagen.
tr: Görüntüden renkler çıkarılamıyor.
uk: Неможливо отримати кольори із зображення.

source: Unable to save palette, no colors extracted.
es: No se puede guardar la paleta, no se extrajeron los colores.
tr: Palet kaydedilemiyor, renk çıkarılmadı.
uk: Неможливо зберегти палітру, жодного кольору було отримано.

source: Unable to save palette, no image loaded.
es: No se puede guardar la paleta, no se cargó ninguna imagen.
tr: Palet kaydedilemiyor, görüntü yüklenmemiş.
uk: Неможливо зберегти палітру, немає зображення.

source: Unable to verify file on drop, try with the file chooser in the upper left corner.
es: No se puede verificar el archivo al colocarlo, intente con el selector de archivos en la esquina superior izquierda.
tr: Bırakılan dosya doğrulanamıyor, sol üst köşedeki dosya seçiciyle deneyin.
uk: Неможливо перевірити перетягнутий файл, спробуйте обрати файл через кнопку у ліво-верхньому куті.

source: Unable to read drop.
es: Imposible leer la imágen.
tr: Bırakma okunamıyor.
uk: Неможливо прочитати зображення.

source: Palette Count
es: Contador de colores
tr: Palet Sayısı
uk: Кількість кольорів у палітрі

source: Max amount of colors to retrieve.
es: Cantidad máxima de colores a recuperar.
tr: Alınacak azami renk sayısı.
uk: Максимальна кількість кольорів для отримування.

source: Palette Accuracy
es: Precisión de la paleta
tr: Palet Doğruluğu
uk: Точність палітри

source: Precise
es: Precisa
tr: Hassasiyet
uk: Дуже точно

source: Normal
uk: Нормально

source: Low
es: Baja
tr: Düşük
uk: Неточно

source: _Save Palette
es: _Guardar paleta
tr: Paleti _Kaydet
uk: _Зберегти палітру

source: Drop Image
es: Cargar de imágen
tr: Görüntü Bırak
uk: Перетягніть зображення

source: Drag an image here, click the button below, or click the button in the upper left corner of this window.
es: Arrastre una imagen aquí, haga clic en el botón de abajo o haga clic en el botón en la esquina superior izquierda de esta ventana.
tr: Buraya bir görüntü sürükleyin, aşağıdaki düğmeyi tıklayın ya da bu pencerenin sol üst köşesindeki düğmeye tıklayın.
uk: Перетягніть зображення сюди, натисніть на кнопку знизу або у лівому-верхньому куті цього вікна.

source: Cannot toggle edit mode, no palettes added.
es: No se puede alternar el modo de edición, no se agregaron paletas.
tr: Düzenleme modu değiştirilemiyor, palet eklenmemiş.
uk: Неможливо перемкнути режим редагування, не додано жодної палітри.

source: Edit Palette Name
es: Editar nombre de la paleta
tr: Palet Adını Düzenle
uk: Редагувати назву палітри

source: Duplicate Palette
es: Duplicar paleta
tr: Paleti Çoğalt
uk: Продублювати палітру

source: Delete Palette
es: Eliminar paleta
tr: Paleti Sil
uk: Видалити палітру

source: Add Some Palettes!
es: ¡Agregue algunas paletas!
tr: Kimi Paletler Ekle!
uk: Додайте палітри!

source: Drop an image onto the drop page and extract some colors, or add a palette manually by clicking the button in the lower right corner to get started!
es: !Suelte una imagen en la página de carga de imágenes y extraiga algunos colores, o añada una paleta manualmente haciendo clic en el botón de la esquina inferior derecha para empezar!
tr: Açılan sayfaya bir görüntü bırakın ve kimi renkleri ayıklayın ya da başlamak için sağ alt köşedeki düğmeye tıklayarak elle bir palet ekleyin!
uk: Перетягніть зображення на сторінку перетягування та отримайте кольори, або додайте палітру вручну, натисну кнопку у правому-нижньому куті для того щоб розпочати!

source: Remove Color from Palette
es: Quitar color de la paleta
tr: Rengi Paletten kaldır
uk: Видалити колір із палітри
